
namespace HTP.Yemot.NET.Enums
{
    /// <summary>
    /// סוגי ההשמעות הניתנות להגדרה.
    /// https://f2.freeivr.co.il/topic/31/%D7%94%D7%A9%D7%9E%D7%A2%D7%AA-%D7%A0%D7%AA%D7%95%D7%A0%D7%99%D7%9D-%D7%95%D7%94%D7%95%D7%93%D7%A2%D7%95%D7%AA-%D7%90%D7%99%D7%A9%D7%99%D7%95%D7%AA-id_message-id_list_message
    /// https://f2.freeivr.co.il/topic/56/%D7%9E%D7%95%D7%93%D7%95%D7%9C-api-%D7%AA%D7%A7%D7%A9%D7%95%D7%A8-%D7%A2%D7%9D-%D7%9E%D7%97%D7%A9%D7%91%D7%99%D7%9D-%D7%95%D7%9E%D7%9E%D7%A9%D7%A7%D7%99-%D7%A0%D7%AA%D7%95%D7%A0%D7%99%D7%9D-%D7%97%D7%99%D7%A6%D7%95%D7%A0%D7%99%D7%99%D7%9D/4
    /// </summary>
    public enum MessageItemType
    {
        /// <summary>
        /// השמעת קובץ מתוך המערכת או מהמאגר הגלובלי.
        /// </summary>
        File,
        /// <summary>
        /// השמעת ספרות (לדוגמה 111 המערכת תשמיע "אחת אחת אחת")
        /// </summary>
        Digits,
        /// <summary>
        /// השמעת מספר (לדוגמה 111 המערכת תשמיע "מאה ואחת עשרה")
        /// </summary>
        Number,
        /// <summary>
        /// השמעת אותיות (לדוגמה abc המערכת תשמיע "איי בי סי")
        /// </summary>
        Alpha,
        /// <summary>
        /// הקראת טקסט.
        /// חשוב! לא להכניס בטקסט את התווים נקודה (👈 .👉 ) וקו מפריד (👈 -👉 ).
        /// </summary>
        Text,
        /// <summary>
        /// הקראת טקסט מתוך קובץ במערכת
        /// </summary>
        Speech,
        /// <summary>
        /// מוזיקה בהמתנה.
        /// </summary>
        MusicOnHold,
        /// <summary>
        /// השמעת תאריך לועזי21/12/2022
        /// </summary>
        Date,
        /// <summary>
        /// השמעת תאריך עברי 21/12/2022 - כ"ז כיסלו תשפ"ג
        /// </summary>
        DateH,
        /// <summary>
        /// השמעה שעה לפי משתנה רצוי
        /// </summary>
        Zmanim,
        /// <summary>
        /// הודעת מערכת
        /// </summary>
        SystemMessage,
        /// <summary>
        /// מעבר לשלוחה אחרת (לא ניתן לשרשר הודעות נוספות לאחר פקודה זו)
        /// </summary>
        GoToFolder,
        /// <summary>
        /// כלום - מיועד להערות לדוגמא להסביר מה המשמעות של ההודעת מערכת שתשמיעו לאחר מכן, שימו לב לא להשתמש ב"."
        /// </summary>
        Noop
    }
    /// <summary>
    /// מצב קליטת נתוני משתמש
    /// </summary>
    public enum InputMode
    {
        /// <summary>
        /// הקשה
        /// </summary>
        Tap,
        /// <summary>
        /// זיהוי דיבור
        /// </summary>
        Voice,
        /// <summary>
        /// הקלטה
        /// </summary>
        Record
    }
    /// <summary>
    /// צורת קליטת נתוני משתמש והשמעת הנתונים שנקלטו למשתמש
    /// </summary>
    public enum InputType
    {
        /// <summary>
        /// משמיע את מה שהוקש בצורת מספר כלומר 22 יהיה "עשרים ושתים".
        /// </summary>
        Number,
        /// <summary>
        /// משמיע את מה שהוקש בצורת ספרות כלומר 22 המערכת תשמיע "שתים שתים".
        /// </summary>
        Digits,
        /// <summary>
        /// משמיע את מה שהוקש בצורת מחיר.
        /// לדוגמה: במידה והמשתמש הקיש 53 המערכת תשמיע "חמישים ושלוש שקלים".
        /// דוגמא נוספת: במידה והמשתמש הקיש הקיש 53 כוכבית 23, המערכת תשמיע "חמישים ושלוש שקלים ועשרים ושלוש אגורות".
        /// כמו כן בסטרינג שיישלח לשרת יופיע 53.23 (כלומר המערכת מחליפה את מקש הכוכבית בנקודה).
        /// </summary>
        Price,
        /// <summary>
        /// משמיע את מה שהוקש בצורת שעה. כלומר 2359 המערכת תשמיע "עשרים ושלוש חמישים ותשע".
        /// יש צורך להגדיר מינימום ומקסימום 4 ספרות.
        /// </summary>
        Time,
        /// <summary>
        /// משמיע את ההקשה בצורת תאריך.
        /// כלומר 10122019 המערכת תשמיע "עשר דצמבר אלפיים ותשע עשרה".
        /// יש צורך להגדיר מינימום ומקסימום 8 ספרות.
        /// </summary>
        Date,
        /// <summary>
        /// משמיע את מה שהוקש בצורת תאריך עברי.
        /// כלומר 23125779 המערכת תשמיע "כ"ט אלול תשע"ט".
        /// יש צורך להגדיר מינימום ומקסימום 8 ספרות.
        /// </summary>
        HebrewDate,
        /// <summary>
        /// ייתן להקיש תעודת זהות תקינה בלבד.
        /// המערכת תשמיע את ההקשה בצורת ספרות.
        /// יש צורך להגדיר מינימום 8 ספרות ומקסימום 9 ספרות.
        /// </summary>
        TeudatZehut,
        /// <summary>
        /// ייתן להקיש רק מספר טלפון ישראלי תקין.
        /// המערכת תשמיע את ההקשה בצורת ספרות.
        /// יש צורך להגדיר מינימום 9 ספרות ומקסימום 10 ספרות.
        /// </summary>
        Phone,
        /// <summary>
        /// בצורת אותיות.
        /// במקרה של הקשה טלפונית של ספרות זה ישמע כמו הקשת ספרות.
        /// במידה ויש אותיות כמו
        /// abc
        /// אז ישמעו את האותיות אחת אחרי השניה.
        /// </summary>
        Alpha,
        /// <summary>
        /// המערכת תעביר את המשתמש להקלדה במקלדת עברית.
        /// בסיום ההקלדה תשמיע את מה שהוקלד במילים או באותיות
        /// </summary>
        HebrewKeyboard,
        /// <summary>
        /// המערכת תעביר את המשתמש להקלדה במקלדת אנגלית.
        /// בסיום ההקלדה תשמיע את מה שהוקלד במילים או באותיות
        /// </summary>
        EnglishKeyboard,
        /// <summary>
        /// המערכת תעביר את המשתמש להקלדה במקלדת אנגלית מותאמת למייל.
        /// בסיום ההקלדה תשמיע את מה שהוקלד במילים או באותיות.
        /// </summary>
        EmailKeyboard,
        /// <summary>
        /// המערכת תעביר את המשתמש להקלדה במקלדת ספרות כאשר המערכת תשמיע כל הקשה בצורה מיידית בהתאם למקשים שהוקשו.
        /// הערה חשובה במצב זה אין הגבלה של מינימום או מקסימום, והערכים של ההגבלה לא פעילים.
        /// מעלת מקלדת ספרות זה השמעת כל ספרה מיידית ללקוח.
        /// </summary>
        DigitsKeyboard,
        /// <summary>
        /// משמיע למשתמש קובץ שמע בהתאם למה שהוקש.
        /// </summary>
        File,
        /// <summary>
        /// משמיע למשתמש טקסט בהקראה ממוחשבת בהתאם למה שהוקש.
        /// </summary>
        TTS,
        /// <summary>
        /// לא ישמיע את מה שהוקש כלל
        /// </summary>
        NO
    }


}
